[
  {
    "id": "start",
    "text": " You find yourself standing at the edge of a dense, mist-shrouded forest. The trees loom tall and ancient, their gnarled branches reaching toward the darkening sky like skeletal fingers. A narrow path winds its way into the shadows , barely visible among the undergrowth.\n\nThe village elder's words echo in your mind: 'Find the Crystal of Eternity hidden deep within the Whispering Woods, and you may yet save our people from the curse.' Your hand instinctively moves to the small leather pouch at your belt, containing your few possessions.\n\nA cool breeze carries the scent of pine and something else—something older and stranger—from the depths of the forest. Night will fall soon, and you must decide your next move.",
    "image": "/placeholder.svg?height=300&width=600",
    "backgroundMusic": "/music/forest-ambient.mp3",
    "entrySoundEffect": "/sounds/wind-rustle.mp3",
    "typingSoundEffect": "/sounds/typing.mp3",
    "choices": [
      {
        "label": "Follow the path into the forest",
        "next": "forest_path",
        "effects": ["variables.courage += 1"]
      },
      {
        "label": "Search around the forest edge for supplies before entering",
        "next": "forest_edge",
        "effects": ["variables.caution += 1"]
      },
      {
        "label": "Make a torch before venturing into the darkness",
        "next": "make_torch",
        "effects": ["inventory.torch = true", "variables.preparation += 1"]
      }
    ]
  },
  {
    "id": "forest_path",
    "text": " You take a deep breath and step onto the forest path. The canopy above quickly thickens, filtering out most of the remaining daylight. The air grows cooler and damper as you venture deeper, and the sounds of the outside world fade away, replaced by the soft rustling of leaves and occasional distant calls of unknown creatures.\n\nAfter walking for what feels like an hour, you come to a fork in the path. The trail to the left appears more traveled, winding between ancient oaks. The right path is narrower and darker, but you notice strange, faintly glowing mushrooms lining its edges.\n\nAs you consider your options, a sudden movement catches your eye. A small, fox-like creature with unusual silver fur watches you from behind a fallen log, its intelligent eyes seeming to assess your intentions.",
    "backgroundMusic": "/music/deep-forest.mp3",
    "entrySoundEffect": "/sounds/footsteps-leaves.mp3",
    "ambientSound": "/sounds/forest-creatures.mp3",
    "choices": [
      {
        "label": "Take the left path",
        "next": "left_path",
        "effects": ["variables.safety += 1"]
      },
      {
        "label": "Take the right path with the glowing mushrooms",
        "next": "mushroom_path",
        "effects": ["variables.curiosity += 1"]
      },
      {
        "label": "Try to approach the silver fox creature",
        "next": "silver_fox",
        "effects": ["variables.empathy += 1"]
      }
    ]
  },
  {
    "id": "forest_edge",
    "text": " You decide to search the forest's edge before venturing into its depths. Moving carefully along the perimeter, you examine fallen logs and dense underbrush. Your caution is rewarded when you discover a weathered backpack partially hidden beneath a tangle of roots.\n\nInside, you find a small water flask, a worn but serviceable hunting knife, and a curious amulet made of polished green stone. The amulet feels strangely warm to the touch, and symbols you don't recognize are etched into its surface.\n\nAs you secure these items, you notice fresh tracks in the soft earth nearby—too large to belong to any common forest animal. Whatever made them passed this way recently, heading into the forest along the main path.",
    "backgroundMusic": "/music/discovery.mp3",
    "entrySoundEffect": "/sounds/rummaging.mp3",
    "choices": [
      {
        "label": "Follow the main path into the forest",
        "next": "forest_path",
        "effects": ["inventory.knife = true", "inventory.flask = true", "inventory.amulet = true"]
      },
      {
        "label": "Follow the strange tracks",
        "next": "follow_tracks",
        "effects": [
          "inventory.knife = true",
          "inventory.flask = true",
          "inventory.amulet = true",
          "variables.bravery += 1"
        ]
      },
      {
        "label": "Look for a different, less traveled entrance to the forest",
        "next": "hidden_entrance",
        "effects": [
          "inventory.knife = true",
          "inventory.flask = true",
          "inventory.amulet = true",
          "variables.caution += 1"
        ]
      }
    ]
  },
  {
    "id": "make_torch",
    "text": " You gather fallen branches and strips of bark, working quickly as the last light of day fades. Using flint from your pouch, you manage to ignite the makeshift torch. The warm glow pushes back the encroaching darkness, casting long shadows among the trees.\n\nWith your torch held high, you approach the forest entrance. The dancing light reveals details previously hidden in shadow: claw marks scoring several tree trunks and strange symbols carved into a large boulder beside the path.\n\nThe torch crackles and sparks, seeming to agitate something unseen in the forest. You hear rustling movements retreating deeper among the trees, as if your light has disturbed the natural order of this place.",
    "backgroundMusic": "/music/tension.mp3",
    "entrySoundEffect": "/sounds/fire-ignite.mp3",
    "ambientSound": "/sounds/fire-crackle.mp3",
    "choices": [
      {
        "label": "Follow the main path into the forest",
        "next": "forest_path_lit",
        "conditions": ["inventory.torch = true"]
      },
      {
        "label": "Examine the strange symbols on the boulder",
        "next": "examine_symbols",
        "conditions": ["inventory.torch = true"]
      },
      {
        "label": "Follow the sounds of the retreating creatures",
        "next": "follow_creatures",
        "conditions": ["inventory.torch = true"],
        "effects": ["variables.curiosity += 1"]
      }
    ]
  },
  {
    "id": "left_path",
    "text": "You choose the more traveled path, reasoning that it might be safer. The trail winds between towering oaks whose branches form a natural archway overhead. As you walk, you notice small stone markers at regular intervals along the path, each carved with a different symbol.\n\nAfter a while, the forest opens into a small clearing. In the center stands a weathered stone well, its sides covered in moss and lichen. A wooden bucket hangs from a frayed rope beside it. Near the well is a small wooden shrine, dedicated to some forest deity you don't recognize.\n\nAs you approach the well, you hear a soft humming sound coming from within its depths. The air around the clearing feels different—charged with some subtle energy that makes the hairs on your arms stand up.",
    "backgroundMusic": "/music/mystical.mp3",
    "entrySoundEffect": "/sounds/footsteps-leaves.mp3",
    "ambientSound": "/sounds/gentle-wind.mp3",
    "choices": [
      {
        "label": "Look down into the well",
        "next": "well_depths",
        "effects": ["variables.curiosity += 1"]
      },
      {
        "label": "Examine the shrine",
        "next": "forest_shrine",
        "effects": ["variables.wisdom += 1"]
      },
      {
        "label": "Draw water from the well",
        "next": "well_water",
        "conditions": ["inventory.flask = true"],
        "effects": ["inventory.magic_water = true"]
      },
      {
        "label": "Continue past the clearing deeper into the forest",
        "next": "beyond_clearing",
        "effects": ["variables.determination += 1"]
      }
    ]
  },
  {
    "id": "mushroom_path",
    "text": "Intrigued by the glowing mushrooms, you take the narrower path to the right. As you venture deeper, the mushrooms grow more numerous, casting an ethereal blue-green light that illuminates the path in a dreamlike glow. The air here smells of damp earth and something sweet yet alien.\n\nThe path descends slightly, leading you into a grove where the mushrooms grow in elaborate circular patterns. In the center of the largest circle, you spot a peculiar sight: a small wooden door set into the base of an enormous oak tree, sized as if for a child or a very small adult.\n\nAs you watch, tiny motes of light drift from the mushroom caps, floating lazily through the air like luminescent pollen. One lands on your skin, leaving a tingling sensation before fading away.",
    "backgroundMusic": "/music/ethereal.mp3",
    "entrySoundEffect": "/sounds/magical-chimes.mp3",
    "ambientSound": "/sounds/night-insects.mp3",
    "choices": [
      {
        "label": "Knock on the tiny door",
        "next": "fairy_door",
        "effects": ["variables.wonder += 1"]
      },
      {
        "label": "Collect some of the glowing mushrooms",
        "next": "gather_mushrooms",
        "effects": ["inventory.glowing_mushrooms = true", "variables.resourcefulness += 1"]
      },
      {
        "label": "Follow the patterns of mushrooms deeper into the grove",
        "next": "mushroom_maze",
        "effects": ["variables.curiosity += 1"]
      }
    ]
  },
  {
    "id": "silver_fox",
    "text": "You slowly crouch down and extend your hand toward the silver fox, making soft, reassuring sounds. The creature tilts its head, studying you with intelligent eyes that seem almost to glow in the dim forest light.\n\nTo your surprise, instead of fleeing, the fox takes a cautious step forward, then another. When it's just a few feet away, it sits on its haunches and makes a soft chirping sound unlike anything you've heard from a fox before.\n\nSuddenly, a strange sensation washes over you—a feeling of being understood. Images flash in your mind: a crystal glowing deep within the forest, dark shadows pursuing it, and a sense of urgent purpose. As the vision fades, the fox stands and takes a few steps down a barely visible side path before looking back at you expectantly.",
    "backgroundMusic": "/music/magical-encounter.mp3",
    "entrySoundEffect": "/sounds/fox-chirp.mp3",
    "ambientSound": "/sounds/forest-whispers.mp3",
    "choices": [
      {
        "label": "Follow the silver fox down the side path",
        "next": "fox_guide",
        "effects": ["variables.trust += 1", "inventory.fox_companion = true"]
      },
      {
        "label": "Offer the fox some food from your pouch",
        "next": "fox_offering",
        "effects": ["variables.kindness += 1"]
      },
      {
        "label": "Thank the fox but continue on your own path",
        "next": "left_path",
        "effects": ["variables.independence += 1"]
      }
    ]
  },
  {
    "id": "follow_tracks",
    "text": "Gripping your newly acquired knife, you decide to follow the strange tracks into the forest. The trail is clear—large, clawed prints pressed deep into the soft earth, occasionally accompanied by broken branches and disturbed undergrowth.\n\nAs you follow the tracks deeper into the woods, the forest grows darker and more primeval. Ancient trees tower overhead, their massive trunks covered in thick moss. The tracks lead you to a small stream, then continue alongside it.\n\nSuddenly, you freeze. Ahead, hunched by the water's edge, is a massive creature. Its body is covered in shaggy fur, and its broad shoulders suggest tremendous strength. It appears to be drinking from the stream, unaware of your presence. The green amulet in your pocket begins to warm noticeably.",
    "backgroundMusic": "/music/tension.mp3",
    "entrySoundEffect": "/sounds/footsteps-stealth.mp3",
    "ambientSound": "/sounds/stream-water.mp3",
    "choices": [
      {
        "label": "Retreat quietly before the creature notices you",
        "next": "forest_path",
        "effects": ["variables.caution += 1"]
      },
      {
        "label": "Observe the creature from hiding",
        "next": "observe_beast",
        "effects": ["variables.wisdom += 1"]
      },
      {
        "label": "Attempt to communicate with the creature",
        "next": "beast_encounter",
        "conditions": ["inventory.amulet = true"],
        "effects": ["variables.courage += 2"]
      }
    ]
  },
  {
    "id": "hidden_entrance",
    "text": "You decide to search for a less obvious way into the forest. Following the tree line, you eventually discover a narrow gap between two ancient boulders, nearly hidden by hanging vines and ferns. Cool air flows from the opening, carrying the scent of moss and wet stone.\n\nSqueezing through the gap, you find yourself in a ravine that cuts deep into the forest. Sunlight filters down in narrow beams between the high stone walls, illuminating a clear stream that flows along the ravine floor. The path is challenging but navigable, following the stream deeper into the woods.\n\nAs you make your way forward, you notice small niches carved into the ravine walls. Some contain weathered stone figurines, others hold remnants of candles or small offerings of flowers and berries. This place has been used as a secret path for generations.",
    "backgroundMusic": "/music/discovery.mp3",
    "entrySoundEffect": "/sounds/stone-scrape.mp3",
    "ambientSound": "/sounds/water-dripping.mp3",
    "choices": [
      {
        "label": "Follow the ravine deeper into the forest",
        "next": "ravine_depths",
        "effects": ["variables.exploration += 1"]
      },
      {
        "label": "Examine the offerings in the wall niches",
        "next": "ancient_offerings",
        "effects": ["variables.knowledge += 1"]
      },
      {
        "label": "Leave your own offering in one of the niches",
        "next": "make_offering",
        "effects": ["variables.respect += 1", "inventory.blessing = true"]
      }
    ]
  },
  {
    "id": "forest_path_lit",
    "text": "With your torch held high, you follow the main path into the forest. The dancing light casts shifting shadows among the trees, but also reveals details you might have missed in darkness—a patch of medicinal herbs growing beside the path, small carved markers on certain trees, and the occasional glint of eyes watching from the underbrush before quickly retreating from your light.\n\nThe torch seems to keep most forest creatures at bay, though occasionally you hear rustling movements paralleling your path, just beyond the reach of your light. The warm glow also reveals more of those strange claw marks on trees, becoming more frequent as you venture deeper.\n\nAfter walking for some time, you reach a point where the path divides around a massive fallen tree trunk. The bark of this ancient giant is covered in amber-colored sap that gleams in your torchlight like honey.",
    "backgroundMusic": "/music/night-journey.mp3",
    "entrySoundEffect": "/sounds/torch-crackle.mp3",
    "ambientSound": "/sounds/night-forest.mp3",
    "choices": [
      {
        "label": "Take the path around the left side of the fallen tree",
        "next": "amber_grove",
        "conditions": ["inventory.torch = true"],
        "effects": ["variables.exploration += 1"]
      },
      {
        "label": "Take the path around the right side of the fallen tree",
        "next": "shadow_thicket",
        "conditions": ["inventory.torch = true"]
      },
      {
        "label": "Collect some of the amber sap from the fallen tree",
        "next": "collect_amber",
        "conditions": ["inventory.torch = true", "inventory.knife = true"],
        "effects": ["inventory.amber = true", "variables.resourcefulness += 1"]
      }
    ]
  },
  {
    "id": "examine_symbols",
    "text": "You approach the boulder, holding your torch close to illuminate the strange symbols carved into its surface. The markings appear ancient—weathered by countless seasons—yet still clearly visible. They form a circular pattern around what seems to be a stylized tree or crystal.\n\nAs you study the symbols, you begin to recognize some of them: one resembles the moon in different phases, another looks like flowing water, and a third might represent fire or light. The longer you look, the more you sense these aren't random markings but some form of message or map.\n\nOn impulse, you reach out and trace one of the symbols with your finger. To your astonishment, it glows faintly at your touch, and you feel a subtle vibration pass through the stone. The symbol for light—similar to your torch—seems to pulse in response to your flame.",
    "backgroundMusic": "/music/mystery.mp3",
    "entrySoundEffect": "/sounds/stone-resonance.mp3",
    "ambientSound": "/sounds/fire-crackle.mp3",
    "choices": [
      {
        "label": "Touch the symbol representing water",
        "next": "water_symbol",
        "conditions": ["inventory.torch = true"],
        "effects": ["variables.knowledge += 1"]
      },
      {
        "label": "Touch the symbol representing the moon",
        "next": "moon_symbol",
        "conditions": ["inventory.torch = true"],
        "effects": ["variables.intuition += 1"]
      },
      {
        "label": "Try to activate all the symbols in sequence",
        "next": "symbol_sequence",
        "conditions": ["inventory.torch = true"],
        "effects": ["variables.wisdom += 1", "variables.risk += 1"]
      },
      {
        "label": "Continue into the forest, following the main path",
        "next": "forest_path_lit",
        "conditions": ["inventory.torch = true"]
      }
    ]
  },
  {
    "id": "follow_creatures",
    "text": "Intrigued by the retreating sounds, you decide to follow whatever creatures your torch has disturbed. Moving carefully off the main path, you weave between trees and underbrush, following the soft rustling and occasional glimpses of movement ahead.\n\nThe forest grows denser, the spaces between trees narrowing until you're forced to turn sideways to slip between them. Just as you begin to consider turning back, the woods suddenly open into a small, perfectly circular clearing. Your torchlight reveals dozens of tiny, translucent creatures—no larger than your hand—scattering for cover among the roots and mushrooms that ring the space.\n\nIn the center of the clearing stands a single white stone pillar, about waist-high, with a small depression at its top. The depression contains clear water that somehow catches and reflects the moonlight, despite the thick canopy overhead that should block the sky from view.",
    "backgroundMusic": "/music/wonder.mp3",
    "entrySoundEffect": "/sounds/creature-scurry.mp3",
    "ambientSound": "/sounds/magical-tinkling.mp3",
    "choices": [
      {
        "label": "Approach the stone pillar",
        "next": "moonlight_pillar",
        "conditions": ["inventory.torch = true"],
        "effects": ["variables.curiosity += 1"]
      },
      {
        "label": "Try to communicate with the small creatures",
        "next": "forest_sprites",
        "conditions": ["inventory.torch = true"],
        "effects": ["variables.empathy += 1"]
      },
      {
        "label": "Extinguish your torch to see what happens",
        "next": "darkness_clearing",
        "conditions": ["inventory.torch = true"],
        "effects": ["inventory.torch = false", "variables.intuition += 1"]
      }
    ]
  },
  {
    "id": "well_depths",
    "text": "You lean over the edge of the well, peering into its depths. The stone walls are slick with moisture, and strange symbols—similar to those on your amulet—are carved into the stone at regular intervals. The humming sound grows louder as you look down, and you notice a faint blue glow emanating from somewhere deep below.\n\nAs you watch, the water surface ripples, though there's no wind. The ripples form a pattern that seems to match the symbols on the walls. Your amulet grows warm against your chest, and you feel a strange pull, as if something below is calling to you.",
    "backgroundMusic": "/music/mystical.mp3",
    "entrySoundEffect": "/sounds/water-drip.mp3",
    "ambientSound": "/sounds/well-echo.mp3",
    "choices": [
      {
        "label": "Climb down into the well",
        "next": "well_climb",
        "conditions": ["inventory.amulet = true"],
        "effects": ["variables.courage += 2", "variables.curiosity += 1"]
      },
      {
        "label": "Drop a stone to test the depth",
        "next": "well_stone",
        "effects": ["variables.caution += 1"]
      },
      {
        "label": "Return to the clearing",
        "next": "left_path",
        "effects": ["variables.wisdom += 1"]
      }
    ]
  },
  {
    "id": "forest_shrine",
    "text": "You approach the small wooden shrine. It's crafted from dark wood, weathered by time but still sturdy. The front panel is carved with intricate patterns of leaves and vines, surrounding a central symbol that matches the one on your amulet.\n\nAs you get closer, you notice small offerings scattered around the base: fresh flowers, berries, and tiny carved figures. The air around the shrine feels charged with energy, and you sense a presence—not threatening, but watchful.\n\nYour amulet pulses with warmth as you study the carvings. The patterns seem to tell a story, one that might be important to your quest.",
    "backgroundMusic": "/music/mystical.mp3",
    "entrySoundEffect": "/sounds/wood-creak.mp3",
    "ambientSound": "/sounds/forest-whispers.mp3",
    "choices": [
      {
        "label": "Leave an offering at the shrine",
        "next": "shrine_offering",
        "effects": ["variables.respect += 1", "inventory.blessing = true"]
      },
      {
        "label": "Study the carvings more carefully",
        "next": "study_carvings",
        "conditions": ["inventory.amulet = true"],
        "effects": ["variables.knowledge += 1"]
      },
      {
        "label": "Return to the well",
        "next": "left_path",
        "effects": ["variables.caution += 1"]
      }
    ]
  },
  {
    "id": "well_water",
    "text": "You carefully fill your flask with water from the well. As the water flows into the container, it catches the light in an unusual way, seeming to shimmer with an inner glow. The water feels cool but not cold, and there's a subtle energy to it that makes your skin tingle.\n\nAs you secure the flask, you notice the water's surface remains perfectly still, despite your movement. The amulet at your chest grows warm, and you see a faint reflection in the water's surface—not your own, but that of a crystal, glowing with blue light.",
    "backgroundMusic": "/music/magical.mp3",
    "entrySoundEffect": "/sounds/water-splash.mp3",
    "ambientSound": "/sounds/magical-chimes.mp3",
    "choices": [
      {
        "label": "Take a small sip of the water",
        "next": "drink_water",
        "effects": ["variables.courage += 1", "inventory.magic_water = true"]
      },
      {
        "label": "Save the water for later",
        "next": "save_water",
        "effects": ["variables.wisdom += 1", "inventory.magic_water = true"]
      },
      {
        "label": "Return to the shrine",
        "next": "forest_shrine",
        "effects": ["variables.caution += 1"]
      }
    ]
  },
  {
    "id": "fairy_door",
    "text": "You approach the tiny door and knock gently. The sound echoes strangely, as if the tree itself is hollow. For a moment, nothing happens. Then, you hear a soft tinkling sound, like tiny bells, and the door creaks open slightly.\n\nA small, glowing figure emerges—no taller than your hand. It has delicate, translucent wings and wears clothing made of leaves and flower petals. The creature regards you with curiosity, then gestures for you to follow as it flutters toward the center of the mushroom circle.",
    "backgroundMusic": "/music/fairy.mp3",
    "entrySoundEffect": "/sounds/door-creak.mp3",
    "ambientSound": "/sounds/fairy-bells.mp3",
    "choices": [
      {
        "label": "Follow the fairy",
        "next": "fairy_guide",
        "effects": ["variables.wonder += 1", "inventory.fairy_friend = true"]
      },
      {
        "label": "Offer a gift to the fairy",
        "next": "fairy_gift",
        "effects": ["variables.kindness += 1"]
      },
      {
        "label": "Return to the mushroom path",
        "next": "mushroom_path",
        "effects": ["variables.caution += 1"]
      }
    ]
  },
  {
    "id": "gather_mushrooms",
    "text": "You carefully collect some of the glowing mushrooms, being sure to take only a few from each cluster to preserve the pattern. The mushrooms feel warm to the touch, and their glow intensifies as you handle them.\n\nAs you gather them, you notice that the mushrooms seem to pulse in rhythm with your heartbeat. The light they emit creates interesting shadows among the trees, and you catch glimpses of movement in the darkness—small, quick shapes that might be more of the forest's mysterious inhabitants.",
    "backgroundMusic": "/music/discovery.mp3",
    "entrySoundEffect": "/sounds/mushroom-pick.mp3",
    "ambientSound": "/sounds/night-insects.mp3",
    "choices": [
      {
        "label": "Follow the mysterious movements",
        "next": "follow_movements",
        "effects": ["variables.curiosity += 1", "inventory.glowing_mushrooms = true"]
      },
      {
        "label": "Continue to the tiny door",
        "next": "fairy_door",
        "effects": ["variables.caution += 1", "inventory.glowing_mushrooms = true"]
      },
      {
        "label": "Return to the main path",
        "next": "mushroom_path",
        "effects": ["variables.wisdom += 1", "inventory.glowing_mushrooms = true"]
      }
    ]
  },
  {
    "id": "mushroom_maze",
    "text": "You step into the center of the mushroom circle and begin following the patterns. The mushrooms seem to form a path, their glow creating a trail that leads deeper into the grove. As you move, you notice that the mushrooms respond to your presence, their light brightening as you pass.\n\nThe path winds through the trees, and you find yourself in a natural maze formed by the mushroom patterns. Each turn reveals new wonders: tiny glowing insects, flowers that seem to bloom only in the mushroom light, and strange symbols carved into the tree trunks that match those on your amulet.",
    "backgroundMusic": "/music/mystery.mp3",
    "entrySoundEffect": "/sounds/footsteps-soft.mp3",
    "ambientSound": "/sounds/magical-forest.mp3",
    "choices": [
      {
        "label": "Follow the symbols on the trees",
        "next": "follow_symbols",
        "conditions": ["inventory.amulet = true"],
        "effects": ["variables.knowledge += 1"]
      },
      {
        "label": "Collect some glowing mushrooms",
        "next": "gather_mushrooms",
        "effects": ["variables.resourcefulness += 1"]
      },
      {
        "label": "Return to the tiny door",
        "next": "fairy_door",
        "effects": ["variables.caution += 1"]
      }
    ]
  },
  {
    "id": "fox_guide",
    "text": "You follow the silver fox down the narrow path. The creature moves with graceful confidence, pausing occasionally to ensure you're still following. The path winds through dense undergrowth, but the fox seems to know exactly where to step.\n\nAfter some time, you emerge into a small clearing. In the center stands an ancient stone archway, covered in moss and carved with symbols that match those on your amulet. The fox sits beside the archway, watching you expectantly.\n\nThe amulet grows warm against your chest, and you feel a strong pull toward the archway. The air here feels charged with energy, and you sense that this place is significant to your quest.",
    "backgroundMusic": "/music/magical-encounter.mp3",
    "entrySoundEffect": "/sounds/fox-chirp.mp3",
    "ambientSound": "/sounds/forest-whispers.mp3",
    "choices": [
      {
        "label": "Step through the archway",
        "next": "stone_archway",
        "conditions": ["inventory.amulet = true"],
        "effects": ["variables.courage += 2"]
      },
      {
        "label": "Examine the archway more carefully",
        "next": "examine_archway",
        "effects": ["variables.wisdom += 1"]
      },
      {
        "label": "Thank the fox and return to the main path",
        "next": "forest_path",
        "effects": ["variables.gratitude += 1"]
      }
    ]
  },
  {
    "id": "fox_offering",
    "text": "You reach into your pouch and pull out some dried meat. The fox's ears perk up at the smell, but it remains still, watching you carefully. You place the offering on the ground and take a step back.\n\nThe fox approaches slowly, sniffing the meat. Instead of eating it, however, it gently pushes the meat back toward you with its nose, then makes a series of soft chirping sounds. It seems to be trying to communicate something important.",
    "backgroundMusic": "/music/magical-encounter.mp3",
    "entrySoundEffect": "/sounds/fox-chirp.mp3",
    "ambientSound": "/sounds/forest-whispers.mp3",
    "choices": [
      {
        "label": "Follow the fox's guidance",
        "next": "fox_guide",
        "effects": ["variables.trust += 1"]
      },
      {
        "label": "Try to communicate with the fox",
        "next": "fox_communication",
        "effects": ["variables.empathy += 1"]
      },
      {
        "label": "Return to the main path",
        "next": "forest_path",
        "effects": ["variables.independence += 1"]
      }
    ]
  },
  {
    "id": "observe_beast",
    "text": "You remain hidden behind a large tree, watching the creature carefully. It's larger than any animal you've ever seen, with thick fur that seems to shimmer in the dim light. Its movements are surprisingly graceful for its size.\n\nAs you observe, you notice something strange: the creature appears to be collecting glowing mushrooms, carefully placing them in a woven basket. The green amulet in your pocket grows warmer as you watch, and you sense a connection between the amulet and the creature's actions.",
    "backgroundMusic": "/music/tension.mp3",
    "entrySoundEffect": "/sounds/creature-movement.mp3",
    "ambientSound": "/sounds/forest-night.mp3",
    "choices": [
      {
        "label": "Approach the creature",
        "next": "beast_encounter",
        "conditions": ["inventory.amulet = true"],
        "effects": ["variables.courage += 2"]
      },
      {
        "label": "Continue observing",
        "next": "observe_longer",
        "effects": ["variables.wisdom += 1"]
      },
      {
        "label": "Retreat quietly",
        "next": "forest_path",
        "effects": ["variables.caution += 1"]
      }
    ]
  },
  {
    "id": "beast_encounter",
    "text": "You step forward, holding the amulet in your hand. The creature's head snaps up, but instead of attacking, it seems to recognize the amulet. It sets down its basket and approaches slowly, making a deep, rumbling sound that feels more like a greeting than a threat.\n\nAs it gets closer, you see that its eyes glow with the same green light as your amulet. The creature stops a few feet away and extends a massive paw, revealing a crystal shard that matches the one in your vision. It seems to be offering it to you.",
    "backgroundMusic": "/music/magical-encounter.mp3",
    "entrySoundEffect": "/sounds/creature-growl.mp3",
    "ambientSound": "/sounds/magical-forest.mp3",
    "choices": [
      {
        "label": "Accept the crystal shard",
        "next": "accept_crystal",
        "effects": ["inventory.crystal_shard = true", "variables.trust += 2"]
      },
      {
        "label": "Offer something in return",
        "next": "offer_trade",
        "effects": ["variables.kindness += 1"]
      },
      {
        "label": "Ask about the Crystal of Eternity",
        "next": "ask_about_crystal",
        "effects": ["variables.knowledge += 1"]
      }
    ]
  }
]
